benchmark.yml
config:
  target: 'http://ec2-3-120-16-83.eu-central-1.compute.amazonaws.com'
  phases:
    - duration: 1
      arrivalRate: 1
  defaults:
  payload:
    path: "users.csv"
    fields:
      - "user"
  variables:
    key: "xmt6hciqqJQUqO0fWB8x7oGDdDxHhNk0"
scenarios:
  - name "API Call: Get Heart Rate Logs for User"
    flow:
    # - log: "api call for user {{user}} with key {{key}}"
    - get:
        url: "/api/users/{{user}}/heart_rate_logs/purpose/{{key}}"
  - name "API Call: Get Step Logs for User"
    weight: 8
    flow:
    # - log: "api call for user {{user}} with key {{key}}"
    - get:
        url: "/api/users/{{user}}/steps/purpose/{{key}}"
  - name "API Call: Get Step Logs for User"
    weight: 8
    flow:
    # - log: "api call for user {{user}} with key {{key}}"
    - get:
        url: "/api/users/{{user}}/purpose/{{key}}"
      weight: 8