benchmark.yml
config:
  # target: 'http://ec2-3-120-16-83.eu-central-1.compute.amazonaws.com'
  phases:
    - duration: 60
      arrivalRate: 20
  defaults:
  payload:
    path: "users.csv"
    fields:
      - "user"
  variables:
    # key: "Tnwqsblk9nDREP6jWz0sj5QDCxNLn59s"
    key: "xmt6hciqqJQUqO0fWB8x7oGDdDxHhNk0"
scenarios:
  - name: "Mixed Scenario"
    flow:
      - get:
          url: "/api/users/{{user}}/purpose/{{key}}"
      - get:
          url: "/api/users/{{user}}/heart_rate_logs/1/purpose/{{key}}"
      - get:
          url: "/api/users/{{user}}/heart_rate_logs/2/purpose/{{key}}"
      - get:
          url: "/api/users/{{user}}/steps/1/purpose/{{key}}"
      - get:
          url: "/api/users/{{user}}/steps/2/purpose/{{key}}"